# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя способами
text = input("введите любое предложение ")

# первый способ

print(text.replace(' ', '-'))


# второй способ

# text = text.split(' ')
# text = '-'.join(text)
# print(text)
