# Дан список чисел, необходимо его развернуть без использования метода revese и
# функции reversed, а так же дополнительного списка и среза
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
b = a[::-1]
print(b)